In [ ]:
#Project: Predicting Credit Card Approvals

In [ ]:
#Importing packages

In [1]:
import pandas as pd
import numpy as np

In [ ]:
#Upload the database and adding a header

In [10]:
headerlist = ['Gender', 'Age', 'Debt', 'Married', 'BankCustomer', 'EducationalLevel', 'Etnhicity', 'YearsEmployed', 'Priordefault', 'Employed', 'CreditScore', 'DriversLicense', 'Citizen', 'Zipcode', 'Income', 'Approved']

In [11]:
file = pd.read_csv('C:/Users/Danilo/OneDrive - MS365/FIA/PÃ³s Data Science/Credit_card_approval/database/crx.data', header =None)

In [12]:
file.to_csv('data_abt.csv', header = headerlist, index=False)

In [13]:
#EDA

In [14]:
data_abt = pd.read_csv("data_abt.csv")

In [15]:
data_abt.head()

,Gender,Age,Debt,Married,BankCustomer,EducationalLevel,Etnhicity,YearsEmployed,Priordefault,Employed,CreditScore,DriversLicense,Citizen,Zipcode,Income,Approved
0,b,30.83,0.000,u,g,w,v,1.25,t,t,1,f,g,00202,0,+
1,a,58.67,4.460,u,g,q,h,3.04,t,t,6,f,g,00043,560,+
2,a,24.50,0.500,u,g,q,h,1.50,t,f,0,f,g,00280,824,+
3,b,27.83,1.540,u,g,w,v,3.75,t,t,5,t,g,00100,3,+
4,b,20.17,5.625,u,g,w,v,1.71,t,f,0,f,s,00120,0,+

In [21]:
data_abt.describe()

             Debt  YearsEmployed  CreditScore         Income
count  690.000000     690.000000    690.00000     690.000000
mean     4.758725       2.223406      2.40000    1017.385507
std      4.978163       3.346513      4.86294    5210.102598
min      0.000000       0.000000      0.00000       0.000000
25%      1.000000       0.165000      0.00000       0.000000
50%      2.750000       1.000000      0.00000       5.000000
75%      7.207500       2.625000      3.00000     395.500000
max     28.000000      28.500000     67.00000  100000.000000

In [22]:
print(data_abt.nunique())

Gender                3
Age                 350
Debt                215
Married               4
BankCustomer          4
EducationalLevel     15
Etnhicity            10
YearsEmployed       132
Priordefault          2
Employed              2
CreditScore          23
DriversLicense        2
Citizen               3
Zipcode             171
Income              240
Approved              2
dtype: int64

In [33]:
data_abt.isnull().sum()

Gender              0
Age                 0
Debt                0
Married             0
BankCustomer        0
EducationalLevel    0
Etnhicity           0
YearsEmployed       0
Priordefault        0
Employed            0
CreditScore         0
DriversLicense      0
Citizen             0
Zipcode             0
Income              0
Approved            0
dtype: int64

In [ ]:
#Replacing + to 1 and - to 0

In [24]:
data_abt['Approved'] = data_abt['Approved'].replace(['+'],'1')

In [25]:
data_abt['Approved'] = data_abt['Approved'].replace(['-'],'0')

In [26]:
data_abt.head()

,Gender,Age,Debt,Married,BankCustomer,EducationalLevel,Etnhicity,YearsEmployed,Priordefault,Employed,CreditScore,DriversLicense,Citizen,Zipcode,Income,Approved
0,b,30.83,0.000,u,g,w,v,1.25,t,t,1,f,g,00202,0,1
1,a,58.67,4.460,u,g,q,h,3.04,t,t,6,f,g,00043,560,1
2,a,24.50,0.500,u,g,q,h,1.50,t,f,0,f,g,00280,824,1
3,b,27.83,1.540,u,g,w,v,3.75,t,t,5,t,g,00100,3,1
4,b,20.17,5.625,u,g,w,v,1.71,t,f,0,f,s,00120,0,1

In [30]:
data_abt.Gender.value_counts()

b    468
a    210
?     12
Name: Gender, dtype: int64

In [31]:
data_abt.Married.value_counts()

u    519
y    163
?      6
l      2
Name: Married, dtype: int64

In [34]:
data_abt.BankCustomer.value_counts()

g     519
p     163
?       6
gg      2
Name: BankCustomer, dtype: int64

In [35]:
data_abt.EducationalLevel.value_counts()

c     137
q      78
w      64
i      59
aa     54
ff     53
k      51
cc     41
m      38
x      38
d      30
e      25
j      10
?       9
r       3
Name: EducationalLevel, dtype: int64

In [36]:
data_abt.Etnhicity.value_counts()

v     399
h     138
bb     59
ff     57
?       9
j       8
z       8
dd      6
n       4
o       2
Name: Etnhicity, dtype: int64

In [37]:
data_abt.Priordefault.value_counts()

t    361
f    329
Name: Priordefault, dtype: int64

In [38]:
data_abt.Employed.value_counts()

f    395
t    295
Name: Employed, dtype: int64

In [39]:
data_abt.DriversLicense.value_counts()

f    374
t    316
Name: DriversLicense, dtype: int64

In [40]:
data_abt.Approved.value_counts()

0    383
1    307
Name: Approved, dtype: int64

In [44]:
data_abt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 690 entries, 0 to 689
Data columns (total 16 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Gender            690 non-null    object
 1   Age               690 non-null    object
 2   Debt              690 non-null    float64
 3   Married           690 non-null    object
 4   BankCustomer      690 non-null    object
 5   EducationalLevel  690 non-null    object
 6   Etnhicity         690 non-null    object
 7   YearsEmployed     690 non-null    float64
 8   Priordefault      690 non-null    object
 9   Employed          690 non-null    object
 10  CreditScore       690 non-null    int64
 11  DriversLicense    690 non-null    object
 12  Citizen           690 non-null    object
 13  Zipcode           690 non-null    object
 14  Income            690 non-null    int64
 15  Approved          690 non-null    object
dtypes: float64(2), int64(2), object(12)
memory usage: 86.4+ KB

In [45]:
for col in data_abt.columns:
    print(col)

Gender
Age
Debt
Married
BankCustomer
EducationalLevel
Etnhicity
YearsEmployed
Priordefault
Employed
CreditScore
DriversLicense
Citizen
Zipcode
Income
Approved